nakhonthai/ESP32APRS_Audio/src/main.cpp
/*
 Name:		ESP32 APRS Internet Gateway
 Created:	1-Nov-2021 14:27:23
 Author:	HS5TQA/Atten
 Support IS: host:aprs.dprns.com port:14580
 Support IS monitor: http://aprs.dprns.com:14501
 Support in LINE Group APRS Only
*/

#include <Arduino.h>
#include <esp_task_wdt.h>
#include "main.h"
#include <LibAPRSesp.h>
#include <limits.h>
#include <KISS.h>
#include "webservice.h"
#include <WiFiUdp.h>
#include "ESP32Ping.h"
#include <WiFi.h>
#include <WiFiMulti.h>
#include <WiFiClient.h>
#include "cppQueue.h"
#include "digirepeater.h"
#include "igate.h"
#include "wireguardif.h"
#include "wireguard.h"
#include "driver/pcnt.h"

#include <TinyGPS++.h>
#include <pbuf.h>
#include <parse_aprs.h>

#include <Fonts/FreeSansBold9pt7b.h>
#include <Fonts/FreeSerifItalic9pt7b.h>
#include "Font/Seven_Segment24pt7b.h"

#include "wireguard_vpn.h"
#include <WiFiUdp.h>

#include <WiFiClientSecure.h>

#include <SoftwareSerial.h>
// SoftwareSerial ss(-1, -1);

#include <ModbusMaster.h>

#include "sensor.h"

#include <rom/spi_flash.h>
#include "FS.h"
#include <LITTLEFS.h>

#include <time.h>

#include "AFSK.h"

// #include <PPPoS.h>
#define CONFIG_I2C_ENABLE_DEBUG_LOG 0

#define EEPROM_SIZE 4096

#ifdef BLUETOOTH
#include "BluetoothSerial.h"
#endif

#include <Wire.h>
#ifndef __XTENSA__
TwoWire Wire1 = TwoWire(1);
#endif
#ifdef OLED
#include "Adafruit_SSD1306.h"
#include <Adafruit_GFX.h>
#include <Adafruit_I2CDevice.h>

#define SCREEN_WIDTH 128 // OLED display width, in pixels
#define SCREEN_HEIGHT 64 // OLED display height, in pixels
// Declaration for an SSD1306 display connected to I2C (SDA, SCL pins)
#define OLED_RESET 4        // Reset pin # (or -1 if sharing Arduino reset pin)
#define SCREEN_ADDRESS 0x3D ///< See datasheet for Address; 0x3D for 128x64, 0x3C for 128x32
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, -1);

#endif

#define FORMAT_LITTLEFS_IF_FAILED true
extern fs::LITTLEFSFS LITTLEFS;

bool i2c_busy = false;

struct pbuf_t aprs;
ParseAPRS aprsParse;

TinyGPSPlus gps;

// instantiate ModbusMaster object
ModbusMaster modbus;

#ifdef __XTENSA__
#define BOOT_PIN 0
#else
#define BOOT_PIN 9
#endif

#define VBAT_PIN 35
// #define WIRE 4
//  #define POWER_PIN 12
//  #define PULLDOWN_PIN 27
//  #define SQL_PIN 33

// #define MODEM_PWRKEY 5
// #define MODEM_TX 17
// #define MODEM_RX 16

#define LED_TX 4
#define LED_RX 2

#define PPP_APN "internet"
#define PPP_USER ""
#define PPP_PASS ""

const char *str_status[] = {
    "IDLE_STATUS",
    "NO_SSID_AVAIL",
    "SCAN_COMPLETED",
    "CONNECTED",
    "CONNECT_FAILED",
    "CONNECTION_LOST",
    "DISCONNECTED"};

// PPPoS ppp;

WiFiMulti wifiMulti;

time_t systemUptime = 0;
time_t wifiUptime = 0;

uint8_t Sleep_Activate = 0;
unsigned long StandByTick = 0;

bool lastHeard_Flag = 0;

boolean KISS = false;
bool aprsUpdate = false;

long timeSleep = 0;

boolean gotPacket = false;
AX25Msg incomingPacket;

bool lastPkg = false;
bool afskSync = false;
float dBV = 0;
int mVrms = 0;
float rssi = 0;
float snr = 0;
float freqErr = 0;

extern int8_t adcEn;
extern int8_t dacEn;

long timeNetwork, timeAprs, timeGui;

// cppQueue PacketBuffer(sizeof(AX25Msg), 5, IMPLEMENTATION); // Instantiate queue
#ifdef OLED
cppQueue dispBuffer(300, 5, IMPLEMENTATION);
cppQueue queTxDisp(sizeof(txDisp), 5, IMPLEMENTATION); // Instantiate queue

void pushTxDisp(uint8_t ch, const char *name, char *info)
{
    if (!config.tx_display)
        return;

    txDisp pkg;

    pkg.tx_ch = ch;
    strcpy(pkg.name, name);
    strcpy(pkg.info, info);
    queTxDisp.push(&pkg); // ใส่แพ็จเก็จจาก TNC ลงคิวบัพเฟอร์
}
#endif

statusType status;
RTC_DATA_ATTR igateTLMType igateTLM;
RTC_DATA_ATTR dataTLMType systemTLM;
txQueueType *txQueue;
// #ifdef BOARD_HAS_PSRAM
// txQueueType *txQueue;
// #else
// RTC_DATA_ATTR txQueueType txQueue[PKGTXSIZE];
// #endif
RTC_DATA_ATTR double LastLat, LastLng;
RTC_DATA_ATTR time_t lastTimeStamp;
RTC_DATA_ATTR uint32_t COUNTER0_RAW;
RTC_DATA_ATTR uint32_t COUNTER1_RAW;

extern RTC_DATA_ATTR uint8_t digiCount;

String RF_VERSION;

Configuration config;

pkgListType *pkgList;

TelemetryType *Telemetry;

RTC_DATA_ATTR double VBat;
RTC_DATA_ATTR bool VBat_Flag = false;
RTC_DATA_ATTR double TempNTC;

RTC_NOINIT_ATTR uint16_t TLM_SEQ;
RTC_NOINIT_ATTR uint16_t IGATE_TLM_SEQ;
RTC_NOINIT_ATTR uint16_t DIGI_TLM_SEQ;

TaskHandle_t taskNetworkHandle;
TaskHandle_t taskAPRSHandle;
TaskHandle_t taskAPRSPollHandle;
TaskHandle_t taskSerialHandle;
TaskHandle_t taskGPSHandle;
TaskHandle_t taskSensorHandle;

unsigned long timerNetwork, timerNetwork_old;
unsigned long timerAPRS, timerAPRS_old;
unsigned long timerGPS, timerGPS_old;
unsigned long timerSerial, timerSerial_old;

// SoftwareSerial SerialRF;
EspSoftwareSerial::UART SerialRF;

bool firstGpsTime = true;
time_t startTime = 0;

#ifdef BLUETOOTH
BluetoothSerial SerialBT;

void Bluetooth()
{
    if (SerialBT.available())
    {
        char raw[500];
        int i = 0;
        memset(raw, 0, sizeof(raw));
        i = SerialBT.readBytes((uint8_t *)&raw, 500);

        if (config.bt_mode == 1)
        { // TNC2RAW MODE
            pkgTxPush(raw, strlen(raw), 1);
        }
        else if (config.bt_mode == 2)
        {
            // KISS MODE
            for (int n = 0; n < i; n++)
                kiss_serial((uint8_t)raw[n]);
        }
    }
}
#endif

// Set your Static IP address for wifi AP
IPAddress local_IP(192, 168, 4, 1);
IPAddress gateway(192, 168, 4, 254);
IPAddress subnet(255, 255, 255, 0);

IPAddress vpn_IP(192, 168, 44, 195);

int pkgTNC_count = 0;

xQueueHandle pcnt_evt_queue;              // A queue to handle pulse counter events
pcnt_isr_handle_t user_isr_handle = NULL; // user's ISR service handle

/* A sample structure to pass events from the PCNT
 * interrupt handler to the main program.
 */
typedef struct
{
    int unit;                // the PCNT unit that originated an interrupt
    uint32_t status;         // information on the event type that caused the interrupt
    unsigned long timeStamp; // The time the event occured
} pcnt_evt_t;

unsigned long upTimeStamp = 0;
void convertSecondsToDHMS(char *dmhs, unsigned long totalSeconds)
{
    // Calculate days, hours, minutes, and seconds
    unsigned int days = totalSeconds / 86400;           // 86400 seconds in a day
    unsigned int hours = (totalSeconds % 86400) / 3600; // 3600 seconds in an hour
    unsigned int minutes = (totalSeconds % 3600) / 60;  // 60 seconds in a minute
    unsigned int seconds = totalSeconds % 60;

    sprintf(dmhs, "%dD[%d:%d:%d]", days, hours, minutes, seconds);
    // Print the result in D:H:M:S format
    // Serial.print("Time: ");
    // Serial.print(days);
    // Serial.print("D ");
    // Serial.print(hours);
    // Serial.print("H ");
    // Serial.print(minutes);
    // Serial.print("M ");
    // Serial.print(seconds);
    // Serial.println("S");
}

/* Decode what PCNT's unit originated an interrupt
 * and pass this information together with the event type
 * and timestamp to the main program using a queue.
 */
// static void pcnt_intr_handler(void *arg)
// {
//     unsigned long currentMillis = millis(); // Time at instant ISR was called
//     uint32_t intr_status = 0xFFFF; //PCNT.int_st.val;
//     int i = 0;
//     pcnt_evt_t evt;
//     portBASE_TYPE HPTaskAwoken = pdFALSE;

//     for (i = 0; i < PCNT_UNIT_MAX; i++)
//     {
//         if (intr_status & (BIT(i)))
//         {
//             evt.unit = i;
//             /* Save the PCNT event type that caused an interrupt
//                to pass it to the main program */
//             evt.status = PCNT.status_unit[i].val;
//             evt.timeStamp = currentMillis;
//             PCNT.int_clr.val = BIT(i);
//             xQueueSendFromISR(pcnt_evt_queue, &evt, &HPTaskAwoken);
//             if (HPTaskAwoken == pdTRUE)
//             {
//                 portYIELD_FROM_ISR();
//             }
//         }
//     }
// }

