nakhonthai/ESP32APRS_Audio/src/main.cpp
    config.sensor[7].enable = false;
    config.sensor[7].port = 0;
    config.sensor[7].address = 2;
    config.sensor[7].samplerate = 10;
    config.sensor[7].averagerate = 600;
    config.sensor[7].eqns[0] = 0; // a
    config.sensor[7].eqns[1] = 1; // b
    config.sensor[7].eqns[2] = 0; // c
    config.sensor[7].type = SENSOR_PRESSURE;
    sprintf(config.sensor[7].parm, "Pressure");
    sprintf(config.sensor[7].unit, "hPa(mBar)");

    config.sensor[8].enable = false;
    config.sensor[8].port = 0;
    config.sensor[8].address = 2;
    config.sensor[8].samplerate = 10;
    config.sensor[8].averagerate = 600;
    config.sensor[8].eqns[0] = 0;   // a
    config.sensor[8].eqns[1] = 0.2; // b
    config.sensor[8].eqns[2] = 0;   // c
    config.sensor[8].type = SENSOR_RAIN;
    sprintf(config.sensor[8].parm, "Rain");
    sprintf(config.sensor[8].unit, "mm.");

    config.sensor[9].enable = false;
    config.sensor[9].port = 0;
    config.sensor[9].address = 2;
    config.sensor[9].samplerate = 10;
    config.sensor[9].averagerate = 600;
    config.sensor[9].eqns[0] = 0; // a
    config.sensor[9].eqns[1] = 1; // b
    config.sensor[9].eqns[2] = 0; // c
    config.sensor[9].type = SENSOR_WIND_SPD;
    sprintf(config.sensor[9].parm, "Wind Speed");
    sprintf(config.sensor[9].unit, "kPh");

#ifdef CORE_DEBUG_LEVEL
    config.uart0_enable = false;
    config.uart0_baudrate = 115200;
    config.uart0_rx_gpio = 20;
    config.uart0_tx_gpio = 21;
    config.uart0_rts_gpio = -1;
#else
    config.uart0_enable = false;
    config.uart0_baudrate = 9600;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.uart0_rts_gpio = -1;
#endif

    config.uart1_enable = false;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 18;
    config.uart1_tx_gpio = 19;
    config.uart1_rts_gpio = -1;

    // config.uart2_enable = false;
    // config.uart2_baudrate = 9600;
    // config.uart2_rx_gpio = 16;
    // config.uart2_tx_gpio = 17;
    // config.uart2_rts_gpio = -1;

    config.modbus_enable = false;
    config.modbus_de_gpio = -1;
    config.modbus_address = 0;
    config.modbus_channel = 0;

    config.onewire_enable = false;
    config.onewire_gpio = -1;

    config.pwr_en = false;
    config.pwr_mode = MODE_A;        // A=Continue,B=Wait for receive,C=Send and sleep
    config.pwr_sleep_interval = 600; // sec
    config.pwr_stanby_delay = 300;   // sec
    config.pwr_sleep_activate = ACTIVATE_TRACKER | ACTIVATE_WIFI;
    config.pwr_gpio = -1;
    config.pwr_active = 1;

    for (int i = 0; i < 5; i++)
    {
        config.trk_tlm_avg[i] = false;
        config.trk_tlm_sensor[i] = 0;
        config.trk_tlm_precision[i] = 0;
        config.trk_tlm_offset[i] = 0;
        memset(config.trk_tlm_UNIT[i], 0, 8);
        memset(config.trk_tlm_PARM[i], 0, 10);
        config.trk_tlm_EQNS[i][0] = 0; // a av2 + bv + c
        config.trk_tlm_EQNS[i][1] = 1; // b
        config.trk_tlm_EQNS[i][2] = 0; // c
    }

    for (int i = 0; i < 5; i++)
    {
        config.digi_tlm_avg[i] = false;
        config.digi_tlm_sensor[i] = 0;
        config.digi_tlm_precision[i] = 0;
        config.digi_tlm_offset[i] = 0;
        memset(config.digi_tlm_UNIT[i], 0, 8);
        memset(config.digi_tlm_PARM[i], 0, 10);
        config.digi_tlm_EQNS[i][0] = 0; // a av2 + bv + c
        config.digi_tlm_EQNS[i][1] = 1; // b
        config.digi_tlm_EQNS[i][2] = 0; // c
    }

    for (int i = 0; i < 5; i++)
    {
        config.igate_tlm_avg[i] = false;
        config.igate_tlm_sensor[i] = 0;
        config.igate_tlm_precision[i] = 0;
        config.igate_tlm_offset[i] = 0;
        memset(config.igate_tlm_UNIT[i], 0, 8);
        memset(config.igate_tlm_PARM[i], 0, 10);
        config.igate_tlm_EQNS[i][0] = 0; // a av2 + bv + c
        config.igate_tlm_EQNS[i][1] = 1; // b
        config.igate_tlm_EQNS[i][2] = 0; // c
    }

    for (int i = 0; i < WX_SENSOR_NUM; i++)
    {
        config.wx_sensor_enable[i] = false;
        config.wx_sensor_avg[i] = true;
        config.wx_sensor_ch[i] = 0;
    }

#ifdef OLED
    config.i2c_enable = true;
    config.i2c_sda_pin = 21;
    config.i2c_sck_pin = 22;
#else
    config.i2c_enable = false;
    config.i2c_sda_pin = -1;
    config.i2c_sck_pin = -1;
#endif
    config.i2c_freq = 400000;
    config.i2c1_enable = false;
    config.i2c1_sda_pin = -1;
    config.i2c1_sck_pin = -1;
    config.i2c1_freq = 100000;

    config.counter0_enable = false;
    config.counter0_active = 0;
    config.counter0_gpio = -1;

    config.counter1_enable = false;
    config.counter1_active = 0;
    config.counter1_gpio = -1;

    config.ext_tnc_enable = false;
    config.ext_tnc_channel = 0;
    config.ext_tnc_mode = 2;

    sprintf(config.path[0], "TRACE2-2");
    sprintf(config.path[1], "WIDE1-1");
    sprintf(config.path[2], "WIDE1-1,WIDE2-1");
    sprintf(config.path[3], "RFONLY");

    config.log = 0;
}

unsigned long NTP_Timeout;
unsigned long pingTimeout;

bool psramBusy = false;

bool waitPSRAM(bool state)
{
#ifdef BOARD_HAS_PSRAM
    if (state)
    {
        int i = 0;
        while (psramBusy)
        {
            delay(1);
            if (i++ > 1000)
            {
                log_e("PSRAM Busy Timeout");
                return false;
            }
        }
        return true;
    }
    else
    {
        psramBusy = false;
        return true;
    }
#else
    return true;
#endif
}

const char *lastTitle = "LAST HEARD";

int tlmList_Find(char *call)
{
    int i;
    for (i = 0; i < TLMLISTSIZE; i++)
    {
        if (strstr(Telemetry[i].callsign, call) != NULL)
            return i;
    }
    return -1;
}

int tlmListOld()
{
    int i, ret = 0;
    time_t minimum = Telemetry[0].time;
    for (i = 1; i < TLMLISTSIZE; i++)
    {
        if (Telemetry[i].time < minimum)
        {
            minimum = Telemetry[i].time;
            ret = i;
        }
        if (Telemetry[i].time > now())
            Telemetry[i].time = 0;
    }
    return ret;
}

int pkgList_Find(char *call)
{
    int i;
    for (i = 0; i < PKGLISTSIZE; i++)
    {
        if (strstr(pkgList[(int)i].calsign, call) != NULL)
            return i;
    }
    return -1;
}

int pkgList_Find(char *call, uint16_t type)
{
    int i;
    for (i = 0; i < PKGLISTSIZE; i++)
    {
        if (pkgList[i].type == type)
        {
            if (strstr(pkgList[i].calsign, call) != NULL)
            {
                return i;
            }
        }
    }
    return -1;
}

int pkgList_Find(char *call, char *object, uint16_t type)
{
    int i;
    for (i = 0; i < PKGLISTSIZE; i++)
    {
        if (pkgList[i].type == type)
        {
            if (strnstr(pkgList[i].calsign, call, strlen(call)) != NULL)
            {
                if (strnstr(pkgList[i].object, object, strlen(object)) != NULL)
                    return i;
            }
        }
    }
    return -1;
}

int pkgListOld()
{
    int i, ret = -1;
    time_t minimum = time(NULL) + 86400; // pkgList[0].time;
    for (i = 0; i < PKGLISTSIZE; i++)
    {
        if (pkgList[(int)i].time < minimum)
        {
            minimum = pkgList[(int)i].time;
            ret = i;
        }
    }
    return ret;
}

void sort(pkgListType a[], int size)
{
    pkgListType t;
    char *ptr1;
    char *ptr2;
    char *ptr3;
    ptr1 = (char *)&t;
#ifdef BOARD_HAS_PSRAM
    while (psramBusy)
        delay(1);
    psramBusy = true;
#endif
    for (int i = 0; i < (size - 1); i++)
    {
        for (int o = 0; o < (size - (i + 1)); o++)
        {
            if (a[o].time < a[o + 1].time)
            {
                ptr2 = (char *)&a[o];
                ptr3 = (char *)&a[o + 1];
                memcpy(ptr1, ptr2, sizeof(pkgListType));
                memcpy(ptr2, ptr3, sizeof(pkgListType));
                memcpy(ptr3, ptr1, sizeof(pkgListType));
            }
        }
    }
    psramBusy = false;
}

