nakhonthai/ESP32APRS_Audio/src/main.cpp
    // if (config.counter0_enable)
    // {
    //     pcnt_init_channel(PCNT_UNIT_0, config.counter0_gpio, config.counter0_active); // Initialize Unit 0 to pin 4
    // }
    // if (config.counter1_enable)
    // {
    //     pcnt_init_channel(PCNT_UNIT_1, config.counter1_gpio, config.counter1_active); // Initialize Unit 0 to pin 4
    // }
    log_d("UART config");
    if (config.uart0_enable)
    {
#ifndef CORE_DEBUG_LEVEL
        Serial.begin(config.uart0_baudrate, SERIAL_8N1, config.uart0_rx_gpio, config.uart0_tx_gpio);
#endif
    }
    if (config.uart1_enable)
    {
        Serial1.begin(config.uart1_baudrate, SERIAL_8N1, config.uart1_rx_gpio, config.uart1_tx_gpio);
    }
    // if (config.uart2_enable)
    // {
    //     Serial2.begin(config.uart2_baudrate, SERIAL_8N1, config.uart2_rx_gpio, config.uart2_tx_gpio);
    // }
    log_d("MODBUS config");
    if (config.modbus_enable)
    {
        if (config.modbus_channel == 1)
        {
            modbus.begin(config.modbus_address, Serial);
        }
        else if (config.modbus_channel == 2)
        {
            modbus.begin(config.modbus_address, Serial1);
        }
#ifdef __XTENSA__
        else if (config.modbus_channel == 3)
        {
            modbus.begin(config.modbus_address, Serial2);
        }
#endif
        if (config.modbus_channel > 0 && config.modbus_channel < 4)
        {
            // Modbus slave ID 1
            if (config.modbus_de_gpio > -1)
            {
                pinMode(config.modbus_de_gpio, OUTPUT);
                // Callbacks allow us to configure the RS485 transceiver correctly
                modbus.preTransmission(preTransmission);
                modbus.postTransmission(postTransmission);
            }
        }
    }

    log_d("RF Module config");

    afskSetSQL(config.rf_sql_gpio, config.rf_sql_active);
    afskSetPTT(config.rf_ptt_gpio, config.rf_ptt_active);
    afskSetPWR(config.rf_pwr_gpio, config.rf_pwr_active);
    setPtt(false);
    if (config.rf_en)
        RF_MODULE(true);
    log_d("Free heap: %d", ESP.getHeapSize());
#ifdef BLUETOOTH
    if (config.bt_master)
        SerialBT.begin(config.bt_name); // Bluetooth device name
#endif

#ifdef OLED
    if (config.oled_enable == true)
    {
        display.clearDisplay();
        display.setTextSize(1);
        display.display();
    }
#endif

    showDisp = true;
    curTab = 3;
    oledSleepTimeout = millis() + (config.oled_timeout * 1000);

    // enableLoopWDT();
    // enableCore0WDT();
    // enableCore1WDT();
    // disableCore1WDT();

    oledSleepTimeout = millis() + (config.oled_timeout * 1000);
    AFSKInitAct = false;
    log_d("GNSS config");
    if (config.gnss_enable)
    {
        if ((config.gnss_channel > 0) && (config.gnss_channel < 4))
        {
            if (strstr("AT", config.gnss_at_command) != NULL)
            {
                if (config.gnss_channel == 1)
                {
                    Serial.println(config.gnss_at_command);
                }
                else if (config.gnss_channel == 2)
                {
                    Serial1.println(config.gnss_at_command);
                }
#ifdef __XTENSA__
                else if (config.gnss_channel == 3)
                {
                    Serial2.println(config.gnss_at_command);
                }
#endif
            }
        }
    }
    log_d("Start Task");

    if (config.wifi_mode != 0)
    {
        xTaskCreatePinnedToCore(
            taskNetwork,        /* Function to implement the task */
            "taskNetwork",      /* Name of the task */
            12000,              /* Stack size in words */
            NULL,               /* Task input parameter */
            1,                  /* Priority of the task */
            &taskNetworkHandle, /* Task handle. */
            1);                 /* Core where the task should run */
    }

    xTaskCreatePinnedToCore(
        taskAPRSPoll,        /* Function to implement the task */
        "taskAPRSPoll",      /* Name of the task */
        4096,                /* Stack size in words */
        NULL,                /* Task input parameter */
        2,                   /* Priority of the task */
        &taskAPRSPollHandle, /* Task handle. */
        1);                  /* Core where the task should run */
    // Task 1
    xTaskCreatePinnedToCore(
        taskAPRS,        /* Function to implement the task */
        "taskAPRS",      /* Name of the task */
        8192,            /* Stack size in words */
        NULL,            /* Task input parameter */
        1,               /* Priority of the task */
        &taskAPRSHandle, /* Task handle. */
        0);              /* Core where the task should run */

    if (config.gnss_enable)
    {
        xTaskCreatePinnedToCore(
            taskGPS,        /* Function to implement the task */
            "taskGPS",      /* Name of the task */
            3072,           /* Stack size in words */
            NULL,           /* Task input parameter */
            2,              /* Priority of the task */
            &taskGPSHandle, /* Task handle. */
            0);             /* Core where the task should run */
    }

    if (config.ext_tnc_enable)
    {
        xTaskCreatePinnedToCore(
            taskSerial,        /* Function to implement the task */
            "taskSerial",      /* Name of the task */
            2048,              /* Stack size in words */
            NULL,              /* Task input parameter */
            3,                 /* Priority of the task */
            &taskSerialHandle, /* Task handle. */
            0);                /* Core where the task should run */
    }

    bool SensorEn = false;
    for (int i = 0; i < SENSOR_NUMBER; i++)
    {
      if (config.sensor[i].enable)
      {
        SensorEn = true;
        break;
      }
    }
  
    if (SensorEn == true)
    {
      xTaskCreatePinnedToCore(
          taskSensor,        /* Function to implement the task */
          "taskSensor",      /* Name of the task */
          4096,              /* Stack size in words */
          NULL,              /* Task input parameter */
          1,                 /* Priority of the task */
          &taskSensorHandle, /* Task handle. */
          0);                /* Core where the task should run */
    }

    upTimeStamp = millis() / 1000;
}

String getTimeStamp()
{
    char strtmp[50];
    time_t now;
    time(&now);
    struct tm *info = gmtime(&now);
    sprintf(strtmp, "%02d%02d%02dz", info->tm_mday, info->tm_hour, info->tm_min);
    return String(strtmp);
}

int pkgCount = 0;

float conv_coords(float in_coords)
{
    // Initialize the location.
    float f = in_coords;
    // Get the first two digits by turning f into an integer, then doing an integer divide by 100;
    // firsttowdigits should be 77 at this point.
    int firsttwodigits = ((int)f) / 100; // This assumes that f < 10000.
    float nexttwodigits = f - (float)(firsttwodigits * 100);
    float theFinalAnswer = (float)(firsttwodigits + nexttwodigits / 60.0);
    return theFinalAnswer;
}

void DD_DDDDDtoDDMMSS(float DD_DDDDD, int *DD, int *MM, int *SS)
{
    DD_DDDDD = abs(DD_DDDDD);
    *DD = (int)DD_DDDDD;
    *MM = (int)((DD_DDDDD - *DD) * 60);
    *SS = ((DD_DDDDD - *DD) * 60 - *MM) * 100;
}

String compress_position(double nowLat, double nowLng, int alt_feed, double course, uint16_t spdKnot, char table, char symbol, bool gps)
{
    String str_comp = "";
    String lat, lon;
    lat = deg2lat(nowLat);
    lon = deg2lon(nowLng);
    // ESP_LOGE("GPS", "Aprs Compress");
    //  Translate from semicircles to Base91 format
    char aprs_position[13];
    long latitude = semicircles((char *)lat.c_str(), (nowLat < 0));
    long longitude = semicircles((char *)lon.c_str(), (nowLng < 0));
    long ltemp = 1073741824L - latitude; // 90 degrees - latitude
    // ESP_LOGE("GPS", "lat=%u lon=%u", latitude, longitude);
    memset(aprs_position, 0, sizeof(aprs_position));

