nakhonthai/ESP32APRS_Audio/src/main.cpp
    base91encode(ltemp, aprs_position);
    ltemp = 1073741824L + (longitude >> 1); // 180 degrees + longitude
    base91encode(ltemp, aprs_position + 4);
    // Encode heading
    uint8_t c = (uint8_t)(course / 4);
    // Scan lookup table to encode speed
    uint8_t s = (uint8_t)(log(spdKnot + 1) / log(1.08));
    if ((spdKnot <= 5) && (alt_feed > 0) && config.trk_altitude)
    {
        if (gps)
        {
            // Send Altitude
            aprs_position[11] = '!' + 0x30; // t current,GGA
            int alt = (int)alt_feed;
            int cs = (int)(log(alt) / log(1.002));
            c = (uint8_t)(cs / 91);
            s = (uint8_t)(cs - ((int)c * 91));
            if (s > 91)
                s = 91;
            aprs_position[9] = '!' + c;  // c
            aprs_position[10] = '!' + s; // s
        }
        else
        {
            // Send Range
            aprs_position[11] = '!' + 0x00; //
            aprs_position[9] = '{';         // c = {
            if (!config.rf_power)
            {
                s = 10;
            }
            else
            {
                s = 30;
            }
            aprs_position[10] = '!' + s; // s
        }
    }
    else
    {
        // Send course and speed
        aprs_position[9] = '!' + c;  // c
        aprs_position[10] = '!' + s; // s

        if (gps)
        {
            aprs_position[11] = '!' + 0x20 + 0x18 + 0x06; // t 0x20 1=current,0x18 11=RMC,0x06 110=Other tracker
        }
        else
        {
            aprs_position[11] = '!' + 0x00 + 0x18 + 0x06; // t
        }
    }
    aprs_position[12] = 0;
    // waveFlag = false;
    aprs_position[8] = symbol; // Symbol
    str_comp = String(table) + String(aprs_position);
    return str_comp;
}

// String compress_position(double nowLat, double nowLng, int alt_feed, double course, uint16_t spdKnot, char table, char symbol, bool gps)

// String compressMicE(float lat, float lon, uint16_t heading, uint16_t speed, uint8_t type, uint8_t *telem, size_t telemLen, char *grid, char *status, int32_t alt, char table, char symbol)
// {
//     String strRet = "";
//     // sanity checks first
//     if (((telemLen == 0) && (telem != NULL)) || ((telemLen != 0) && (telem == NULL)))
//     {
//         return strRet;
//     }

//     if ((telemLen != 0) && (telemLen != 2) && (telemLen != 5))
//     {
//         return strRet;
//     }

//     if ((telemLen > 0) && ((grid != NULL) || (status != NULL) || (alt != RADIOLIB_APRS_MIC_E_ALTITUDE_UNUSED)))
//     {
//         // can't have both telemetry and status
//         return strRet;
//     }

//     // prepare buffers
//     char destCallsign[7];
// #if !RADIOLIB_STATIC_ONLY
//     size_t infoLen = 10;
//     if (telemLen > 0)
//     {
//         infoLen += 1 + telemLen;
//     }
//     else
//     {
//         if (grid != NULL)
//         {
//             infoLen += strlen(grid) + 2;
//         }
//         if (status != NULL)
//         {
//             infoLen += strlen(status);
//         }
//         if (alt > RADIOLIB_APRS_MIC_E_ALTITUDE_UNUSED)
//         {
//             infoLen += 4;
//         }
//     }
//     char *info = new char[infoLen];
// #else
//     char info[RADIOLIB_STATIC_ARRAY_SIZE];
// #endif
//     size_t infoPos = 0;

//     // the following is based on APRS Mic-E implementation by https://github.com/omegat
//     // as discussed in https://github.com/jgromes/RadioLib/issues/430

//     // latitude first, because that is in the destination field
//     float lat_abs = RADIOLIB_ABS(lat);
//     int lat_deg = (int)lat_abs;
//     int lat_min = (lat_abs - (float)lat_deg) * 60.0f;
//     int lat_hun = (((lat_abs - (float)lat_deg) * 60.0f) - lat_min) * 100.0f;
//     destCallsign[0] = lat_deg / 10;
//     destCallsign[1] = lat_deg % 10;
//     destCallsign[2] = lat_min / 10;
//     destCallsign[3] = lat_min % 10;
//     destCallsign[4] = lat_hun / 10;
//     destCallsign[5] = lat_hun % 10;

//     // next, add the extra bits
//     if (type & 0x04)
//     {
//         destCallsign[0] += RADIOLIB_APRS_MIC_E_DEST_BIT_OFFSET;
//     }
//     if (type & 0x02)
//     {
//         destCallsign[1] += RADIOLIB_APRS_MIC_E_DEST_BIT_OFFSET;
//     }
//     if (type & 0x01)
//     {
//         destCallsign[2] += RADIOLIB_APRS_MIC_E_DEST_BIT_OFFSET;
//     }
//     if (lat >= 0)
//     {
//         destCallsign[3] += RADIOLIB_APRS_MIC_E_DEST_BIT_OFFSET;
//     }
//     if (lon >= 100 || lon <= -100)
//     {
//         destCallsign[4] += RADIOLIB_APRS_MIC_E_DEST_BIT_OFFSET;
//     }
//     if (lon < 0)
//     {
//         destCallsign[5] += RADIOLIB_APRS_MIC_E_DEST_BIT_OFFSET;
//     }
//     destCallsign[6] = '\0';

//     // now convert to Mic-E characters to get the "callsign"
//     for (uint8_t i = 0; i < 6; i++)
//     {
//         if (destCallsign[i] <= 9)
//         {
//             destCallsign[i] += '0';
//         }
//         else
//         {
//             destCallsign[i] += ('A' - 10);
//         }
//     }

//     // setup the information field
//     info[infoPos++] = RADIOLIB_APRS_MIC_E_GPS_DATA_CURRENT;

//     // encode the longtitude
//     float lon_abs = RADIOLIB_ABS(lon);
//     int32_t lon_deg = (int32_t)lon_abs;
//     int32_t lon_min = (lon_abs - (float)lon_deg) * 60.0f;
//     int32_t lon_hun = (((lon_abs - (float)lon_deg) * 60.0f) - lon_min) * 100.0f;

//     if (lon_deg <= 9)
//     {
//         info[infoPos++] = lon_deg + 118;
//     }
//     else if (lon_deg <= 99)
//     {
//         info[infoPos++] = lon_deg + 28;
//     }
//     else if (lon_deg <= 109)
//     {
//         info[infoPos++] = lon_deg + 8;
//     }
//     else
//     {
//         info[infoPos++] = lon_deg - 72;
//     }

//     if (lon_min <= 9)
//     {
//         info[infoPos++] = lon_min + 88;
//     }
//     else
//     {
//         info[infoPos++] = lon_min + 28;
//     }

//     info[infoPos++] = lon_hun + 28;

//     // now the speed and heading - this gets really weird
//     int32_t speed_hun_ten = speed / 10;
//     int32_t speed_uni = speed % 10;
//     int32_t head_hun = heading / 100;
//     int32_t head_ten_uni = heading % 100;

//     if (speed <= 199)
//     {
//         info[infoPos++] = speed_hun_ten + 'l';
//     }
//     else
//     {
//         info[infoPos++] = speed_hun_ten + '0';
//     }

