nakhonthai/ESP32APRS_Audio/src/main.cpp
//     info[infoPos++] = speed_uni * 10 + head_hun + 32;
//     info[infoPos++] = head_ten_uni + 28;
//     info[infoPos++] = symbol;
//     info[infoPos++] = table;

//     // onto the optional stuff - check telemetry first
//     if (telemLen > 0)
//     {
//         if (telemLen == 2)
//         {
//             info[infoPos++] = RADIOLIB_APRS_MIC_E_TELEMETRY_LEN_2;
//         }
//         else
//         {
//             info[infoPos++] = RADIOLIB_APRS_MIC_E_TELEMETRY_LEN_5;
//         }
//         for (uint8_t i = 0; i < telemLen; i++)
//         {
//             sprintf(&(info[infoPos]), "%02X", telem[i]);
//             infoPos += 2;
//         }
//     }
//     else
//     {
//         if (grid != NULL)
//         {
//             memcpy(&(info[infoPos]), grid, strlen(grid));
//             infoPos += strlen(grid);
//             info[infoPos++] = '/';
//             info[infoPos++] = 'G';
//         }
//         if (status != NULL)
//         {
//             info[infoPos++] = ' ';
//             memcpy(&(info[infoPos]), status, strlen(status));
//             infoPos += strlen(status);
//         }
//         if (alt > RADIOLIB_APRS_MIC_E_ALTITUDE_UNUSED)
//         {
//             // altitude is offset by -10 km
//             int32_t alt_val = alt + 10000;

//             // ... and encoded in base 91 for some reason
//             info[infoPos++] = (alt_val / 8281) + 33;
//             info[infoPos++] = ((alt_val % 8281) / 91) + 33;
//             info[infoPos++] = ((alt_val % 8281) % 91) + 33;
//             info[infoPos++] = '}';
//         }
//     }
//     info[infoPos++] = '\0';

//     strRet = String(info);
//     return strRet;
// }

String trk_gps_postion(String comment)
{
    String rawData = "";
    String lat, lon;
    double nowLat, nowLng;
    char rawTNC[300];
    char aprs_table, aprs_symbol;
    // char timestamp[10];
    struct tm tmstruct;
    double dist, course, speed;
    time_t nowTime;

    memset(rawTNC, 0, sizeof(rawTNC));
    // getLocalTime(&tmstruct, 5000);
    // sprintf(timestamp, "%02d%02d%02d%02d", (tmstruct.tm_mon + 1), tmstruct.tm_mday, tmstruct.tm_hour, tmstruct.tm_min);
    time(&nowTime);
    // nowTime = gps.time.value();
    if (lastTimeStamp == 0)
        lastTimeStamp = nowTime;

    // lastTimeStamp=10000;
    // nowTime=lastTimeStamp+1800;
    time_t tdiff = nowTime - lastTimeStamp;

    // aprs_table = config.aprs_table;
    // aprs_symbol = config.aprs_symbol;
    if (config.trk_smartbeacon)
    {
        if (SB_SPEED < config.trk_lspeed)
        {
            aprs_table = config.trk_symstop[0];
            aprs_symbol = config.trk_symstop[1];
            SB_SPEED = 0;
        }
        else
        {
            aprs_table = config.trk_symmove[0];
            aprs_symbol = config.trk_symmove[1];
        }
    }
    else
    {
        aprs_table = config.trk_symbol[0];
        aprs_symbol = config.trk_symbol[1];
    }

    if (gps.location.isValid()) // && (gps.hdop.hdop() < 10.0))
    {
        nowLat = gps.location.lat();
        nowLng = gps.location.lng();

        uint16_t spdKnot;
        if (LastLng == 0 || LastLat == 0)
        {
            course = gps.course.deg();
            spdKnot = (uint16_t)gps.speed.knots();
        }
        else
        {
            dist = distance(LastLng, LastLat, nowLng, nowLat);
            course = direction(LastLng, LastLat, nowLng, nowLat);
            if (dist > 50.0F)
                dist = 0;
            if (tdiff > 10 && (nowTime > lastTimeStamp))
                speed = dist / ((double)tdiff / 3600);
            else
                speed = 0.0F;

            if (speed > 999)
                speed = 999.0F;
            // uint16_t spdMph=(uint16_t)(speed / 1.609344);
            spdKnot = (uint16_t)(speed * 0.53996F);
            if (spdKnot > 94)
                spdKnot = 0;
        }

        LastLat = nowLat;
        LastLng = nowLng;
        lastTimeStamp = nowTime;

        if (config.trk_compress)
        { // Compress DATA

            String compPosition = compress_position(nowLat, nowLng, gps.altitude.feet(), course, spdKnot, aprs_table, aprs_symbol, (gps.satellites.value() > 3));
            // ESP_LOGE("GPS", "Compress=%s", aprs_position);
            if (strlen(config.trk_item) >= 3)
            {
                char object[10];
                memset(object, 0x20, 10);
                memcpy(object, config.trk_item, strlen(config.trk_item));
                object[9] = 0;
                if (config.trk_timestamp)
                {
                    String timeStamp = getTimeStamp();
                    sprintf(rawTNC, ";%s*%s%s", object, timeStamp, compPosition.c_str());
                }
                else
                {
                    sprintf(rawTNC, ")%s!%s", config.trk_item, compPosition.c_str());
                }
            }
            else
            {
                if (config.trk_timestamp)
                {
                    String timeStamp = getTimeStamp();
                    sprintf(rawTNC, "/%s%s", timeStamp, compPosition.c_str());
                }
                else
                {
                    sprintf(rawTNC, "!%s", compPosition.c_str());
                }
            }
        }
        else
        { // None compress DATA
            int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
            char lon_ew = 'E';
            char lat_ns = 'N';
            if (nowLat < 0)
                lat_ns = 'S';
            if (nowLng < 0)
                lon_ew = 'W';
            DD_DDDDDtoDDMMSS(nowLat, &lat_dd, &lat_mm, &lat_ss);
            DD_DDDDDtoDDMMSS(nowLng, &lon_dd, &lon_mm, &lon_ss);
            char csd_spd[8];
            memset(csd_spd, 0, sizeof(csd_spd));
            sprintf(csd_spd, "%03d/%03d", (int)gps.course.deg(), (int)gps.speed.knots());
            if (strlen(config.trk_item) >= 3)
            {
                char object[10];
                memset(object, 0x20, 10);
                memcpy(object, config.trk_item, strlen(config.trk_item));
                object[9] = 0;
                if (config.trk_timestamp)
                {
                    String timeStamp = getTimeStamp();
                    sprintf(rawTNC, ";%s*%s%02d%02d.%02d%c%c%03d%02d.%02d%c%c%s", object, timeStamp, lat_dd, lat_mm, lat_ss, lat_ns, aprs_table, lon_dd, lon_mm, lon_ss, lon_ew, aprs_symbol, csd_spd);
                }
                else
                {
                    sprintf(rawTNC, ")%s!%02d%02d.%02d%c%c%03d%02d.%02d%c%c%s", config.trk_item, lat_dd, lat_mm, lat_ss, lat_ns, aprs_table, lon_dd, lon_mm, lon_ss, lon_ew, aprs_symbol, csd_spd);
                }
            }
            else
            {
                if (config.trk_timestamp)
                {
                    String timeStamp = getTimeStamp();
                    sprintf(rawTNC, "/%s%02d%02d.%02d%c%c%03d%02d.%02d%c%c%s", timeStamp, lat_dd, lat_mm, lat_ss, lat_ns, aprs_table, lon_dd, lon_mm, lon_ss, lon_ew, aprs_symbol, csd_spd);
                }
                else
                {
                    sprintf(rawTNC, "!%02d%02d.%02d%c%c%03d%02d.%02d%c%c%s", lat_dd, lat_mm, lat_ss, lat_ns, aprs_table, lon_dd, lon_mm, lon_ss, lon_ew, aprs_symbol, csd_spd);
                }
            }
            if (config.trk_altitude)
            {

