nakhonthai/ESP32APRS_Audio/src/main.cpp
String digi_position(double lat, double lon, double alt, String comment)
{
    String tnc2Raw = "";
    int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
    char strtmp[500], loc[100];
    char lon_ew = 'E';
    char lat_ns = 'N';
    if (lat < 0)
        lat_ns = 'S';
    if (lon < 0)
        lon_ew = 'W';
    memset(strtmp, 0, sizeof(strtmp));
    memset(loc, 0, sizeof(loc));
    DD_DDDDDtoDDMMSS(lat, &lat_dd, &lat_mm, &lat_ss);
    DD_DDDDDtoDDMMSS(lon, &lon_dd, &lon_mm, &lon_ss);
    char strAltitude[12];
    memset(strAltitude, 0, sizeof(strAltitude));
    if (alt > 0)
    {
        sprintf(strAltitude, "/A=%06d", (int)(alt * 3.28F));
    }
    if (config.digi_timestamp)
    {
        String timeStamp = getTimeStamp();
        sprintf(loc, "/%s%02d%02d.%02d%c%c%03d%02d.%02d%c%c", timeStamp, lat_dd, lat_mm, lat_ss, lat_ns, config.digi_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.digi_symbol[1]);
    }
    else
    {
        sprintf(loc, "!%02d%02d.%02d%c%c%03d%02d.%02d%c%c", lat_dd, lat_mm, lat_ss, lat_ns, config.digi_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.digi_symbol[1]);
    }
    if (config.digi_ssid == 0)
        sprintf(strtmp, "%s>APE32A", config.digi_mycall);
    else
        sprintf(strtmp, "%s-%d>APE32A", config.digi_mycall, config.digi_ssid);
    tnc2Raw = String(strtmp);
    if (config.digi_path < 5)
    {
        if (config.digi_path > 0)
            tnc2Raw += "-" + String(config.digi_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.digi_path);
    }
    tnc2Raw += ":";
    tnc2Raw += String(loc);
    tnc2Raw += String(config.digi_phg) + String(strAltitude);
    tnc2Raw += comment + " " + String(config.digi_comment);
    return tnc2Raw;
}

void tracker_status(char *text)
{
    char name[50];

    if (config.trk_ssid > 0)
        sprintf(name, "%s-%d>APE32A", config.trk_mycall, config.trk_ssid);
    else
        sprintf(name, "%s>APE32A", config.trk_mycall);

    String tnc2Raw = String(name);
    if (config.trk_path < 5)
    {
        if (config.trk_path > 0)
            tnc2Raw += "-" + String(config.trk_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.trk_path);
    }
    tnc2Raw += ":>";
    tnc2Raw += String(text);

    uint8_t SendMode = 0;
    if (config.trk_loc2rf)
        SendMode |= RF_CHANNEL;
    if (config.trk_loc2inet)
        SendMode |= INET_CHANNEL;
    pkgTxPush(tnc2Raw.c_str(), tnc2Raw.length(), 0, SendMode);
}

void igate_status(char *text)
{
    char name[50];

    if (config.aprs_ssid > 0)
        sprintf(name, "%s-%d>APE32A", config.aprs_mycall, config.aprs_ssid);
    else
        sprintf(name, "%s>APE32A", config.aprs_mycall);

    String tnc2Raw = String(name);
    if (config.igate_path < 5)
    {
        if (config.igate_path > 0)
            tnc2Raw += "-" + String(config.igate_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.igate_path);
    }
    tnc2Raw += ":>";
    tnc2Raw += String(text);

    uint8_t SendMode = 0;
    if (config.igate_loc2rf)
        SendMode |= RF_CHANNEL;
    if (config.igate_loc2inet)
        SendMode |= INET_CHANNEL;
    pkgTxPush(tnc2Raw.c_str(), tnc2Raw.length(), 0, SendMode);
}

void digi_status(char *text)
{
    char name[50];

    if (config.digi_ssid > 0)
        sprintf(name, "%s-%d>APE32A", config.digi_mycall, config.digi_ssid);
    else
        sprintf(name, "%s>APE32A", config.digi_mycall);

    String tnc2Raw = String(name);
    if (config.digi_path < 5)
    {
        if (config.digi_path > 0)
            tnc2Raw += "-" + String(config.digi_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.digi_path);
    }
    tnc2Raw += ":>";
    tnc2Raw += String(text);

    uint8_t SendMode = 0;
    if (config.digi_loc2rf)
        SendMode |= RF_CHANNEL;
    if (config.digi_loc2inet)
        SendMode |= INET_CHANNEL;
    pkgTxPush(tnc2Raw.c_str(), tnc2Raw.length(), 0, SendMode);
}

String wx_report(double lat, double lon, double alt, String comment)
{
    String tnc2Raw = "";
    int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
    char strtmp[500], loc[100];
    char lon_ew = 'E';
    char lat_ns = 'N';
    if (lat < 0)
        lat_ns = 'S';
    if (lon < 0)
        lon_ew = 'W';
    memset(strtmp, 0, sizeof(strtmp));
    memset(loc, 0, sizeof(loc));
    DD_DDDDDtoDDMMSS(lat, &lat_dd, &lat_mm, &lat_ss);
    DD_DDDDDtoDDMMSS(lon, &lon_dd, &lon_mm, &lon_ss);
    // char strAltitude[12];
    // memset(strAltitude, 0, sizeof(strAltitude));
    // if (alt > 0)
    // {
    //     sprintf(strAltitude, "/A=%06d", (int)(alt * 3.28F));
    // }
    if (config.wx_gps)
    {
        if (gps.satellites.value() > 5 && gps.hdop.hdop() < 5)
            mslAltitude = alt;
    }
    else
    {
        mslAltitude = alt;
    }
    if (strlen(config.wx_object) >= 3)
    {
        char object[10];
        memset(object, 0x20, 10);
        memcpy(object, config.wx_object, strlen(config.wx_object));
        object[9] = 0;
        if (config.wx_timestamp)
        {
            String timeStamp = getTimeStamp();
            sprintf(loc, ";%s*%s%02d%02d.%02d%c/%03d%02d.%02d%c_", object, timeStamp.c_str(), lat_dd, lat_mm, lat_ss, lat_ns, lon_dd, lon_mm, lon_ss, lon_ew);
        }
        else
        {
            sprintf(loc, ")%s!%02d%02d.%02d%c/%03d%02d.%02d%c_", config.wx_object, lat_dd, lat_mm, lat_ss, lat_ns, lon_dd, lon_mm, lon_ss, lon_ew);
        }
    }
    else
    {
        if (config.wx_timestamp)
        {
            String timeStamp = getTimeStamp();
            sprintf(loc, "@%s%02d%02d.%02d%c/%03d%02d.%02d%c_", timeStamp.c_str(), lat_dd, lat_mm, lat_ss, lat_ns, lon_dd, lon_mm, lon_ss, lon_ew);
        }
        else
        {
            sprintf(loc, "!%02d%02d.%02d%c/%03d%02d.%02d%c_", lat_dd, lat_mm, lat_ss, lat_ns, lon_dd, lon_mm, lon_ss, lon_ew);
        }
    }
    if (config.wx_ssid == 0)
        sprintf(strtmp, "%s>APE32A", config.wx_mycall);
    else
        sprintf(strtmp, "%s-%d>APE32A", config.wx_mycall, config.wx_ssid);
    tnc2Raw = String(strtmp);
    if (config.wx_path < 5)
    {
        if (config.wx_path > 0)
            tnc2Raw += "-" + String(config.wx_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.wx_path);
    }
    tnc2Raw += ":";
    tnc2Raw += String(loc);
    char WxRaw[500];
    memset(WxRaw, 0, 500);
    getRawWx(&WxRaw[0]);
    tnc2Raw += String(WxRaw);
    tnc2Raw += comment + String(config.wx_comment);
    return tnc2Raw;
}

int packet2Raw(String &tnc2, AX25Msg &Packet)
{
    if (Packet.len < 1)
        return 0;
    tnc2 = String(Packet.src.call);
    if (Packet.src.ssid > 0)
    {
        tnc2 += String(F("-"));
        tnc2 += String(Packet.src.ssid);
    }
    tnc2 += String(F(">"));
    tnc2 += String(Packet.dst.call);
    if (Packet.dst.ssid > 0)
    {
        tnc2 += String(F("-"));
        tnc2 += String(Packet.dst.ssid);
    }
    for (int i = 0; i < Packet.rpt_count; i++)
    {
        if (i >= 8)
            break;
        tnc2 += String(",");
        tnc2 += String(Packet.rpt_list[i].call);
        if (Packet.rpt_list[i].ssid > 0)
        {
            tnc2 += String("-");
            tnc2 += String(Packet.rpt_list[i].ssid);
        }
        if (Packet.rpt_flags & (1 << i))
            tnc2 += "*";
    }
    tnc2 += String(F(":"));
    tnc2 += String((const char *)Packet.info);

    return tnc2.length();
}

long sendTimer = 0;
int btn_count = 0;
long timeCheck = 0;
int timeHalfSec = 0;

unsigned long timeTask;
unsigned long timeSec;
char nmea[100];
int nmea_idx = 0;
void loop()
{
    if (millis() > timeTask)
    {
        timeTask = millis() + 10000;
        unsigned long upT = (millis() / 1000) - upTimeStamp;
        convertSecondsToDHMS(nmea, upT);
        log_d("Task process APRS=%iuS\t NETWORK=%iuS\t GPS=%iuS\t SERIAL=%iuS\n", timerAPRS, timerNetwork, timerGPS, timerSerial);
        log_d("upTime %s Free heap: %s KB \tWiFi:%s ,RSSI:%s dBm", nmea, String((float)ESP.getFreeHeap() / 1000, 1).c_str(), String(WiFi.SSID()).c_str(), String(WiFi.RSSI()).c_str());
    }

    vTaskDelay(10 / portTICK_PERIOD_MS);

#ifdef BLUETOOTH
    if (config.bt_master)
        Bluetooth();
#endif

    if (digitalRead(BOOT_PIN) == LOW)
    {
        btn_count++;
        if (btn_count > 1000) // Push BOOT 10sec
        {
            digitalWrite(LED_RX_PIN, HIGH);
            digitalWrite(LED_TX_PIN, HIGH);
        }
    }
    else
    {
        if (btn_count > 0)
        {
            // Serial.printf("btn_count=%dms\n", btn_count * 10);
            if (btn_count > 1000) // Push BOOT 10sec to Factory Default
            {
                // digitalWrite(LED_RX, LOW);
                // digitalWrite(LED_TX, LOW);
                defaultConfig();
                log_d("SYSTEM REBOOT NOW!");
                esp_restart();
            }
            else
            {
                showDisp = true;
                timeSec = timeHalfSec = millis();
                // if (oledSleepTimeout > 0)
                //{
                curTab++;
                if (curTab > 4)
                    curTab = 0;
                //}
            }
            btn_count = 0;
        }
    }

