nakhonthai/ESP32APRS_Audio/src/main.cpp
#ifdef OLED
    // Popup Display
    if (config.oled_enable == true)
    {
        if (dispBuffer.getCount() > 0)
        {
            if (millis() > timeHalfSec)
            {
                char tnc2[300];
                dispBuffer.pop(&tnc2);
                dispWindow(String(tnc2), 0, false);
                timeHalfSec = millis() + (config.dispDelay * 1000);
                oledSleepTimeout = millis() + (config.oled_timeout * 1000);
            }
        }
        else
        {
            if (!getTransmit())
            {
                if (queTxDisp.getCount() > 0)
                { // have tx info display
                    txDisp txs;
                    if (queTxDisp.pop(&txs))
                    {
                        dispTxWindow(txs);
                        delay(1000);
                        // if (menuSel == 0)
                        //     curTabOld = curTab + 1;
                    }
                }
            }

            // Sleep display
            if (millis() > timeHalfSec)
            {
                if (millis() > timeSec && timeHalfSec > 0)
                {
                    timeSec = millis() + 10000;
                    showDisp = true;
                    // timeHalfSec = 0;
                    // oledSleepTimeout = millis() + (config.oled_timeout * 1000);
                }
                else
                {
                    if (millis() > oledSleepTimeout && oledSleepTimeout > 0)
                    {
                        showDisp = false;
                        timeHalfSec = 0;
                        oledSleepTimeout = 0;
                        i2c_busy = true;
                        display.clearDisplay();
                        display.display();
                        i2c_busy = false;
                    }
                }
            }
        }

        if (showDisp)
        {
            showDisp = false;
            timeHalfSec = millis();
            // oledSleepTimeout = millis() + (config.oled_timeout * 1000);
            switch (curTab)
            {
            case 0:
                statisticsDisp();
                timeSec = millis() + 10000;
                break;
            case 1:
                pkgLastDisp();
                timeSec = millis() + 10000;
                break;
            case 2:
                pkgCountDisp();
                timeSec = millis() + 10000;
                break;
            case 3:
                systemDisp();
                break;
            case 4:
                gpsDisp();
                break;
            }
        }
    }
#endif

    // Tick one secound
    if (millis() > timeCheck)
    {
        // esp_task_wdt_reset();
        timeCheck = millis() + 1000;
        if (ESP.getFreeHeap() < 60000)
            esp_restart();
        // Serial.println(String(ESP.getFreeHeap()));
    }
}

String sendIsAckMsg(String toCallSign, int msgId)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    strcpy(&call[0], toCallSign.c_str());
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;
    memset(&str[0], 0, 300);

    sprintf(str, "%s-%d>APE32A%s::%s:ack%d", config.aprs_mycall, config.aprs_ssid, VERSION, call, msgId);
    //	client.println(str);
    return String(str);
}

void sendIsPkg(char *raw)
{
    char str[300];
    sprintf(str, "%s-%d>APE32A%s:%s", config.aprs_mycall, config.aprs_ssid, VERSION, raw);
    // client.println(str);
    String tnc2Raw = String(str);
    if (aprsClient.connected())
        aprsClient.println(tnc2Raw); // Send packet to Inet
    if (config.digi_en)
        pkgTxPush(str, strlen(str), 0, RF_CHANNEL);
}

void sendIsPkgMsg(char *raw)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (config.aprs_ssid == 0)
        sprintf(call, "%s", config.aprs_mycall);
    else
        sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

    if (config.aprs_ssid == 0)
        sprintf(str, "%s>APE32A::%s:%s", config.aprs_mycall, call, raw);
    else
        sprintf(str, "%s-%d>APE32A::%s:%s", config.aprs_mycall, config.aprs_ssid, call, raw);

    String tnc2Raw = String(str);
    if (aprsClient.connected())
        aprsClient.println(tnc2Raw); // Send packet to Inet
    // if (config.tnc && config.tnc_digi)
    //     pkgTxUpdate(str, 0);
    // APRS_sendTNC2Pkt(tnc2Raw); // Send packet to RF
}

void sendTelemetry_0(char *raw, bool header)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (strlen(config.trk_item) > 3)
    {
        sprintf(call, "%s", config.trk_item);
    }
    else
    {
        if (config.tlm0_ssid == 0)
            sprintf(call, "%s", config.tlm0_mycall);
        else
            sprintf(call, "%s-%d", config.tlm0_mycall, config.tlm0_ssid);
    }
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

    if (header)
    {
        if (config.tlm0_ssid == 0)
        {
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s>APE32A-%d::%s:%s ", config.tlm0_mycall, config.tlm0_path, call, raw);
                else
                    sprintf(str, "%s>APE32A::%s:%s ", config.tlm0_mycall, call, raw);
            }
            else
            {
                sprintf(str, "%s>APE32A,%s::%s:%s ", config.tlm0_mycall, getPath(config.tlm0_path).c_str(), call, raw);
            }
        }
        else
        {
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s-%d>APE32A-%d::%s:%s ", config.tlm0_mycall, config.tlm0_ssid, config.tlm0_path, call, raw);
                else
                    sprintf(str, "%s-%d>APE32A::%s:%s ", config.tlm0_mycall, config.tlm0_ssid, call, raw);
            }
            else
            {
                sprintf(str, "%s-%d>APE32A,%s::%s:%s ", config.tlm0_mycall, config.tlm0_ssid, getPath(config.tlm0_path).c_str(), call, raw);
            }
        }
    }
    else
    {
        if (config.tlm0_ssid == 0)
        {
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s>APE32A-%d:%s", config.tlm0_mycall, config.tlm0_path, raw);
                else
                    sprintf(str, "%s>APE32A:%s", config.tlm0_mycall, raw);
            }
            else
            {
                sprintf(str, "%s>APE32A,%s:%s", config.tlm0_mycall, getPath(config.tlm0_path).c_str(), raw);
            }
        }
        else
        {
            if (config.tlm0_path < 5)
            {
                if (config.tlm0_path > 0)
                    sprintf(str, "%s-%d>APE32A-%d:%s", config.tlm0_mycall, config.tlm0_ssid, config.tlm0_path, raw);
                else
                    sprintf(str, "%s-%d>APE32A:%s", config.tlm0_mycall, config.tlm0_ssid, raw);
            }
            else
            {
                sprintf(str, "%s-%d>APE32A,%s:%s", config.tlm0_mycall, config.tlm0_ssid, getPath(config.tlm0_path).c_str(), raw);
            }
        }
    }

    uint8_t SendMode = 0;
    if (config.tlm0_2rf)
        SendMode |= RF_CHANNEL;
    if (config.tlm0_2inet)
        SendMode |= INET_CHANNEL;
    pkgTxPush(str, strlen(str), 0, SendMode);

#if 1
    if (config.tlm0_2rf)
    { // TLM SEND TO RF
        SendMode |= RF_CHANNEL;
        // char *rawP = (char *)malloc(rawData.length());
        //  rawData.toCharArray(rawP, rawData.length());
        // memcpy(rawP, rawData.c_str(), rawData.length());
        pkgTxPush(str, strlen(str), 0, RF_CHANNEL);
        // pushTxDisp(TXCH_RF, "TX DIGI POS", sts);
        // free(rawP);
    }
    if (config.tlm0_2inet)
    { // TLM SEND TO APRS-IS

        if (aprsClient.connected())
        {
            status.txCount++;
            aprsClient.printf("%s\r\n", str); // Send packet to Inet
            // pushTxDisp(TXCH_TCP, "TX DIGI POS", sts);
        }
    }
#endif
}

void sendTelemetry_trk(char *raw)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (strlen(config.trk_item) > 3)
    {
        sprintf(call, "%s", config.trk_item);
    }
    else
    {
        if (config.trk_ssid == 0)
            sprintf(call, "%s", config.trk_mycall);
        else
            sprintf(call, "%s-%d", config.trk_mycall, config.trk_ssid);
    }
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

    if (config.trk_ssid == 0)
    {
        if (config.trk_path < 5)
        {
            if (config.trk_path > 0)
                sprintf(str, "%s>APE32A-%d::%s:%s ", config.trk_mycall, config.trk_path, call, raw);
            else
                sprintf(str, "%s>APE32A::%s:%s ", config.trk_mycall, call, raw);
        }
        else
        {
            sprintf(str, "%s>APE32A,%s::%s:%s ", config.trk_mycall, getPath(config.trk_path).c_str(), call, raw);
        }
    }
    else
    {
        if (config.trk_path < 5)
        {
            if (config.trk_path > 0)
                sprintf(str, "%s-%d>APE32A-%d::%s:%s ", config.trk_mycall, config.trk_ssid, config.trk_path, call, raw);
            else
                sprintf(str, "%s-%d>APE32A::%s:%s ", config.trk_mycall, config.trk_ssid, call, raw);
        }
        else
        {
            sprintf(str, "%s-%d>APE32A,%s::%s:%s ", config.trk_mycall, config.trk_ssid, getPath(config.trk_path).c_str(), call, raw);
        }
    }

    uint8_t SendMode = 0;
    if (config.trk_loc2rf)
        SendMode |= RF_CHANNEL;
    if (config.trk_loc2inet)
        SendMode |= INET_CHANNEL;
    pkgTxPush(str, strlen(str), 0, SendMode);

    // if (config.trk_loc2rf)
    // { // TLM SEND TO RF
    //     pkgTxPush(str, strlen(str), 0);
    // }
    // if (config.trk_loc2inet)
    // { // TLM SEND TO APRS-IS
    //     if (aprsClient.connected())
    //     {
    //         status.txCount++;
    //         aprsClient.printf("%s\r\n", str); // Send packet to Inet
    //         delay(2000);
    //     }
    // }
}

void sendTelemetry_igate(char *raw)
{
    char str[300];
    char call[11];
    int i;
    memset(&call[0], 0, 11);
    if (strlen(config.igate_object) > 3)
    {
        sprintf(call, "%s", config.igate_object);
    }
    else
    {
        if (config.aprs_ssid == 0)
            sprintf(call, "%s", config.aprs_mycall);
        else
            sprintf(call, "%s-%d", config.aprs_mycall, config.aprs_ssid);
    }
    i = strlen(call);
    for (; i < 9; i++)
        call[i] = 0x20;

