nakhonthai/ESP32APRS_Audio/src/main.cpp
    if (config.wifi_mode & WIFI_AP_FIX)
    {
        // กำหนดค่าการทำงานไวไฟเป็นแอสเซสพ้อย
        WiFi.softAP(config.wifi_ap_ssid, config.wifi_ap_pass); // Start HOTspot removing password will disable security
        WiFi.softAPConfig(local_IP, gateway, subnet);
        log_d("Access point running. IP address: ");
        log_d("%s", WiFi.softAPIP().toString().c_str());
    }

    if (wifiMulti.run() == WL_CONNECTED)
    {
        log_d("Wi-Fi CONNECTED!");
        log_d("IP address: %s", WiFi.localIP().toString().c_str());
        NTP_Timeout = millis() + 5000;
    }

    pingTimeout = millis() + 10000;
    unsigned long timeNetworkOld = millis();
    timeNetwork = 0;
    if (config.wifi_mode & WIFI_AP_STA_FIX)
        webService();

    wireguard_ctx_t ctx = {0};
    esp_err_t err;
        // err = wireguard_setup(&ctx);
        // if (err != ESP_OK) {
        //     log_d("wireguard_setup: %s", esp_err_to_name(err));
        // }        
    for (;;)
    {
        unsigned long now = millis();
        timeNetwork = now - timeNetworkOld;
        timeNetworkOld = now;
        // wdtNetworkTimer = millis();
        // serviceHandle();
        // esp_task_wdt_reset();
        timerNetwork = micros() - timerNetwork_old;
        vTaskDelay(10 / portTICK_PERIOD_MS);       
        timerNetwork_old = micros(); 

        if (WiFi.isConnected() == true || WiFi.softAPgetStationNum() > 0)
        {
            if (lastHeard_Flag)
            {
                if (millis() > lastHeardTimeout)
                {
                    lastHeardTimeout = millis() + 1000;
                    event_lastHeard();
                    lastHeard_Flag = false;
                }
            }
        }

        if (config.wifi_mode & WIFI_AP_FIX)
        {
            APStationNum = WiFi.softAPgetStationNum();
            if (APStationNum > 0)
            {
                // config.pwr_sleep_activate |= ACTIVATE_WIFI;
                if (WiFi.isConnected() == false)
                {
                    vTaskDelay(9 / portTICK_PERIOD_MS);
                    continue;
                }
            }
        }

        if (wifiMulti.run(connectTimeoutMs) == WL_CONNECTED)
        {
            // config.pwr_sleep_activate |= ACTIVATE_WIFI;
            if (millis() > NTP_Timeout)
            {
                NTP_Timeout = millis() + 86400000;
                // setSyncProvider(getNtpTime);
                log_d("Contacting Time Server\n");
                configTime(3600 * config.timeZone, 0, config.ntp_host);
                // vTaskDelay(500 / portTICK_PERIOD_MS);
                struct tm tmstruct;
                if (getLocalTime(&tmstruct, 5000))
                {
                    time_t systemTime;
                    time(&systemTime);
                    setTime(systemTime);
                    if (systemUptime == 0)
                    {
                        systemUptime = time(NULL);
                    }
                    pingTimeout = millis() + 2000;
                    if (config.vpn)
                    {
                        if (!wireguard_active())
                        {
                            log_d("Setup Wiregurad VPN!");
                            wireguard_setup_old();
                        }
                        // //if(ctx.netif==NULL){
                        //     log_d("wireguard_setup");
                        //     err = wireguard_setup(&ctx);
                        //     if (err != ESP_OK) {
                        //         log_d("wireguard_setup: %s", esp_err_to_name(err));
                        //     } 
                        // //}
                        // log_d("VPN Connecting.");
                        // //if(esp_wireguardif_peer_is_up(&ctx) != ESP_OK){
                           
                        //     err = esp_wireguard_connect(&ctx);
                        //     if (err != ESP_OK) {
                        //         log_d("esp_wireguard_connect: %s", esp_err_to_name(err));
                        //     }else{
                        //         int to=0;
                        //         while (esp_wireguardif_peer_is_up(&ctx) != ESP_OK) {
                        //             vTaskDelay(1000 / portTICK_PERIOD_MS);
                        //             if(++to>5) break;
                        //         }
                        //         log_d("VPN Peer is up");
                        //         esp_wireguard_set_default(&ctx);
                        //     }
                    }
                }
                else
                {
                    NTP_Timeout = millis() + 60000;
                }
            }

            if (config.igate_en)
            {
                if (aprsClient.connected() == false)
                {
                    if (millis() > waitISRetry)
                    {
                        waitISRetry = millis() + 30000; // Retry connect 30Sec
                        if (APRSConnect())
                        {
                            if (config.igate_bcn)
                            {
                                iGatetickInterval = millis() + 10000; // send position after 10sec
                            }
                        }
                    }
                }
                else
                {
                    if (aprsClient.available())
                    {
                        pingTimeout = millis() + 300000;                // Reset ping timout
                        String line = aprsClient.readStringUntil('\n'); // อ่านค่าที่ Server ตอบหลับมาทีละบรรทัด
                        status.isCount++;
                        int start_val = line.indexOf(">", 0); // หาตำแหน่งแรกของ >
                        if (start_val > 3)
                        {
                            String src_call = line.substring(0, start_val);
                            String msg_call = "::" + src_call;

                            status.allCount++;
                            status.rxCount++;
                            igateTLM.RX++;

                            log_d("INET: %s\n", line.c_str());
                            start_val = line.indexOf(":", 10); // Search of info in ax25
                            if (start_val > 5)
                            {
                                String info = line.substring(start_val + 1);
                                size_t rawSize = line.length();
                                char *raw = (char *)calloc(rawSize + 1, sizeof(char));
                                if (raw)
                                {
                                    memset(raw, 0, rawSize + 1);
                                    memcpy(raw, info.c_str(), info.length());

                                    uint16_t type = pkgType(&raw[0]);
                                    int start_dstssid = line.indexOf("-", 1); // get SSID -
                                    if (start_dstssid < 0)
                                        start_dstssid = line.indexOf(" ", 1); // get ssid space
                                    char ssid = 0;
                                    if (start_dstssid > 0)
                                        ssid = line.charAt(start_dstssid + 1);

