nakhonthai/ESP32APRS_Audio/src/main.cpp
                    }
                }
            }
        }
    } // for loop
}

#ifdef OLED
// Routine
void line_angle(signed int startx, signed int starty, unsigned int length, unsigned int angle, unsigned int color)
{
    display.drawLine(startx, starty, (startx + length * cosf(angle * 0.017453292519)), (starty + length * sinf(angle * 0.017453292519)), color);
}

int xSpiGlcdSelFontHeight = 8;
int xSpiGlcdSelFontWidth = 5;

void compass_label(signed int startx, signed int starty, unsigned int length, double angle, unsigned int color)
{
    double angleNew;
    // ushort Color[2];
    uint8_t x_N, y_N, x_S, y_S;
    int x[4], y[4], i;
    int xOffset, yOffset;
    yOffset = (xSpiGlcdSelFontHeight / 2);
    xOffset = (xSpiGlcdSelFontWidth / 2);
    // GLCD_WindowMax();
    angle += 270.0F;
    angleNew = angle;
    for (i = 0; i < 4; i++)
    {
        if (angleNew > 360.0F)
            angleNew -= 360.0F;
        x[i] = startx + (length * cosf(angleNew * 0.017453292519));
        y[i] = starty + (length * sinf(angleNew * 0.017453292519));
        x[i] -= xOffset;
        y[i] -= yOffset;
        angleNew += 90.0F;
    }
    angleNew = angle + 45.0F;
    for (i = 0; i < 4; i++)
    {
        if (angleNew > 360.0F)
            angleNew -= 360.0F;
        x_S = startx + ((length - 3) * cosf(angleNew * 0.017453292519));
        y_S = starty + ((length - 3) * sinf(angleNew * 0.017453292519));
        x_N = startx + ((length + 3) * cosf(angleNew * 0.017453292519));
        y_N = starty + ((length + 3) * sinf(angleNew * 0.017453292519));
        angleNew += 90.0F;
        display.drawLine(x_S, y_S, x_N, y_N, color);
    }
    display.drawCircle(startx, starty, length, color);
    display.setFont();
    display.drawChar((uint8_t)x[0], (uint8_t)y[0], 'N', WHITE, BLACK, 1);
    display.drawChar((uint8_t)x[1], (uint8_t)y[1], 'E', WHITE, BLACK, 1);
    display.drawChar((uint8_t)x[2], (uint8_t)y[2], 'S', WHITE, BLACK, 1);
    display.drawChar((uint8_t)x[3], (uint8_t)y[3], 'W', WHITE, BLACK, 1);
}

void compass_arrow(signed int startx, signed int starty, unsigned int length, double angle, unsigned int color)
{
    double angle1, angle2;
    int xdst, ydst, x1sta, y1sta, x2sta, y2sta;
    int length2 = length / 2;
    angle += 270.0F;
    if (angle > 360.0F)
        angle -= 360.0F;
    xdst = startx + length * cosf(angle * 0.017453292519);
    ydst = starty + length * sinf(angle * 0.017453292519);
    angle1 = angle + 135.0F;
    if (angle1 > 360.0F)
        angle1 -= 360.0F;
    angle2 = angle + 225.0F;
    if (angle2 > 360.0F)
        angle2 -= 360.0F;
    x1sta = startx + length2 * cosf(angle1 * 0.017453292519);
    y1sta = starty + length2 * sinf(angle1 * 0.017453292519);
    x2sta = startx + length2 * cosf(angle2 * 0.017453292519);
    y2sta = starty + length2 * sinf(angle2 * 0.017453292519);
    display.drawLine(startx, starty, xdst, ydst, color);
    display.drawLine(xdst, ydst, x1sta, y1sta, color);
    display.drawLine(x1sta, y1sta, startx, starty, color);
    display.drawLine(startx, starty, x2sta, y2sta, color);
    display.drawLine(x2sta, y2sta, xdst, ydst, color);
}

unsigned long disp_delay = 0;
void dispTxWindow(txDisp txs)
{
    if (config.tx_display == false)
        return;
    i2c_busy = true;
    display.clearDisplay();
    disp_delay = config.dispDelay * 1000;
    timeHalfSec = millis() + disp_delay;
    // send_aprs_table = txs.table;
    // send_aprs_symbol = txs.symbol;

    // display.fillRect(0, 0, 128, 16, WHITE);
    // const uint8_t *ptrSymbol;
    // uint8_t symIdx = send_aprs_symbol - 0x21;
    // if (symIdx > 95)
    //     symIdx = 0;
    // if (send_aprs_table == '/')
    // {
    //     ptrSymbol = &Icon_TableA[symIdx][0];
    // }
    // else if (send_aprs_table == '\\')
    // {
    //     ptrSymbol = &Icon_TableB[symIdx][0];
    // }
    // else
    // {
    //     if (send_aprs_table < 'A' || send_aprs_table > 'Z')
    //     {
    //         send_aprs_table = 'N';
    //         send_aprs_symbol = '&';
    //         symIdx = 5; // &
    //     }
    //     ptrSymbol = &Icon_TableB[symIdx][0];
    // }
    // display.drawYBitmap(0, 0, ptrSymbol, 16, 16, WHITE);
    // if (!(send_aprs_table == '/' || send_aprs_table == '\\'))
    // {
    //     display.drawChar(5, 4, send_aprs_table, BLACK, WHITE, 1);
    //     display.drawChar(6, 5, send_aprs_table, BLACK, WHITE, 1);
    // }

    display.setFont(&FreeSansBold9pt7b);
    display.setCursor(0, 14);
    txs.name[sizeof(txs.name) - 1] = 0;
    if (strlen(txs.name))
    {
        display.printf("%s", txs.name);
    }

    display.setFont(&FreeSerifItalic9pt7b);

    if (txs.tx_ch == TXCH_TCP)
    {
        display.setCursor(5, 42);
        display.print("TCP");
        display.setCursor(15, 57);
        display.print("IP");
    }
    else if (txs.tx_ch == TXCH_RF)
    {
        display.setCursor(3, 42);
        display.print("SEND");
        display.setCursor(15, 57);
        display.print("RF");
    }
    else if (txs.tx_ch == TXCH_DIGI)
    {
        display.setCursor(3, 42);
        display.print("RPT");
        display.setCursor(15, 57);
        display.print("RF");
    }
    else if (txs.tx_ch == TXCH_3PTY)
    {
        display.setCursor(3, 42);
        display.print("FWD");
        display.setCursor(15, 57);
        display.print("RF");
    }

    display.setFont();
    display.setTextColor(WHITE);
    // display.setCursor(115, 0);
    // display.print("TX");

    display.drawRoundRect(0, 16, 128, 48, 5, WHITE);
    display.fillRoundRect(1, 17, 126, 10, 2, WHITE);
    display.setTextColor(BLACK);
    display.setCursor(40, 18);
    display.print("TX STATUS");

    display.setTextColor(WHITE);
    // display.setCursor(50, 30);

    char *pch;
    int y = 30;
    pch = strtok(txs.info, "\n");
    while (pch != NULL)
    {
        display.setCursor(50, y);
        display.printf("%s", pch);
        pch = strtok(NULL, "\n");
        y += 9;
    }

    display.display();
    i2c_busy = false;
}

const char *directions[] = {"N", "NE", "E", "SE", "S", "SW", "W", "NW"};
bool dispPush = 0;

void dispWindow(String line, uint8_t mode, bool filter)
{
    if (config.rx_display == false)
        return;

    struct pbuf_t aprs;
    bool Monitor = false;
    char text[300];
    unsigned char x = 0;
    char itemname[10];
    int start_val = line.indexOf(":}", 10);
    if (start_val > 0)
    {
        String new_info = line.substring(start_val + 2);
        start_val = new_info.indexOf(">", 0);
        if (start_val > 3 && start_val < 12)
            line = new_info;
    }
    start_val = line.indexOf(">", 0); // หาตำแหน่งแรกของ >
    if (start_val > 3 && start_val < 12)
    {
        // powerWakeup();
        //  Serial.println(line);
        // String src_call = line.substring(0, start_val);
        // memset(&aprs, 0, sizeof(pbuf_t));
        // aprs.buf_len = 300;
        // aprs.packet_len = line.length();
        // line.toCharArray(&aprs.data[0], aprs.packet_len);
        // int start_info = line.indexOf(":", 0);
        // int end_ssid = line.indexOf(",", 0);
        // int start_dst = line.indexOf(">", 2);
        // int start_dstssid = line.indexOf("-", start_dst);
        // if ((end_ssid < 0) || (end_ssid > start_info))
        //     end_ssid = start_info;
        // if ((start_dstssid > start_dst) && (start_dstssid < start_dst + 10))
        // {
        //     aprs.dstcall_end_or_ssid = &aprs.data[start_dstssid];
        // }
        // else
        // {
        //     aprs.dstcall_end_or_ssid = &aprs.data[end_ssid];
        // }
        String src_call = line.substring(0, start_val);
        memset(&aprs, 0, sizeof(pbuf_t));
        aprs.buf_len = 300;
        aprs.packet_len = line.length();
        line.toCharArray(&aprs.data[0], aprs.packet_len);
        int start_info = line.indexOf(":", 0);
        if (start_info < 10)
            return;
        int start_dst = line.lastIndexOf(">", start_info);
        if (start_dst < 5)
            return;
        int end_ssid = line.indexOf(",", 10);
        if (end_ssid > start_info || end_ssid < 10)
            end_ssid = start_info;

        int start_dstssid = line.lastIndexOf("-", end_ssid);
        if (start_dstssid < start_dst)
            start_dstssid = -1;
        String path = "";

        if ((end_ssid > start_dst) && (end_ssid < start_info))
        {
            path = line.substring(end_ssid + 1, start_info);
        }

        if (start_dstssid > start_dst)
        {
            aprs.dstcall_end_or_ssid = &aprs.data[start_dstssid + 1];
        }
        else
        {
            aprs.dstcall_end_or_ssid = &aprs.data[end_ssid];
        }
        aprs.info_start = &aprs.data[start_info + 1];
        aprs.dstname = &aprs.data[start_dst + 1];
        aprs.dstname_len = end_ssid - start_dst;
        aprs.dstcall_end = &aprs.data[end_ssid];
        aprs.srccall_end = &aprs.data[start_dst];

