nakhonthai/ESP32APRS_Audio/src/main.cpp
    // display.fillRect(0, 16, 128, 10, WHITE);
    // display.drawLine(0, 16, 0, 63, WHITE);
    display.fillRect(0, 0, 128, 15, WHITE);
    // display.drawLine(0, 16, 0, 63, WHITE);

    // display.drawLine(127, 16, 127, 63, WHITE);
    // display.drawLine(0, 63, 127, 63, WHITE);
    // display.fillRect(1, 25, 126, 38, BLACK);
    display.drawRect(0, 16, 128, 48, WHITE);
    display.fillRect(1, 17, 126, 46, BLACK);
    // display.fillRoundRect(1, 17, 126, 46, 2, WHITE);

    display.setCursor(20, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    display.print("SYSTEM");
    display.setFont();
    display.setCursor(108, 7);
    display.print("4/5");
    display.setTextColor(WHITE);

    display.setCursor(3, 18);
    // display.print("HMEM:");
    display.print("MAC");
    // str = String(ESP.getFreeHeap(), DEC)+"Byte";
    str = String(WiFi.macAddress());
    x = str.length() * 6;
    display.setCursor(126 - x, 18);
    display.print(str);

    display.setCursor(3, 26);
    display.print("IP:");
    str = String(WiFi.localIP().toString());
    x = str.length() * 6;
    display.setCursor(126 - x, 26);
    display.print(str);

    display.setCursor(3, 35);
    display.print("UPTIME:");
    str = String(day(upTime) - 1, DEC) + "D " + String(hour(upTime), DEC) + ":" + String(minute(upTime), DEC) + ":" + String(second(upTime), DEC);
    x = str.length() * 6;
    display.setCursor(126 - x, 35);
    display.print(str);

    display.setCursor(3, 44);
    display.print("WiFi RSSI:");
    str = String(WiFi.RSSI()) + "dBm";
    // str = String(str_status[WiFi.status()]);
    x = str.length() * 6;
    display.setCursor(126 - x, 44);
    display.print(str);

    display.setCursor(3, 53);
    display.print("Firmware:");
    str = "V" + String(VERSION);
    x = str.length() * 6;
    display.setCursor(126 - x, 53);
    display.print(str);

    display.display();
    i2c_busy = false;
}

void gpsDisp()
{

    int x;
    String str;

    display.fillRect(0, 0, 128, 15, WHITE);

    display.drawRect(0, 16, 128, 48, WHITE);
    display.fillRect(1, 17, 126, 46, BLACK);

    display.setCursor(15, 7);
    display.setTextSize(1);
    display.setFont(&FreeSansBold9pt7b);
    display.setTextColor(BLACK);
    display.print("GPS INFO");
    display.setFont();
    display.setCursor(108, 7);
    display.print("5/5");
    display.setTextColor(WHITE);

    display.setCursor(3, 18);
    display.print("LAT");
    str = String(gps.location.lat(), 5);
    x = str.length() * 6;
    display.setCursor(126 - x, 18);
    display.print(str);


    display.setCursor(3, 26);
    display.print("LON");
    str = String(gps.location.lng(), 5);
    x = str.length() * 6;
    display.setCursor(126 - x, 26);
    display.print(str);

    display.setCursor(3, 35);
    display.print("SAT:");
    str = String(gps.satellites.value());
    x = str.length() * 6;
    display.setCursor(126 - x, 35);
    display.print(str);

    display.setCursor(3, 44);
    display.print("Speed:");
    str = String(gps.speed.kmph(), 0);
    str += " km/h";
    x = str.length() * 6;
    display.setCursor(126 - x, 44);
    display.print(str);

    display.setCursor(3, 53);
    display.print("Course:");
    str = String(gps.course.deg(), 0);
    x = str.length() * 6;
    display.setCursor(126 - x, 53);
    display.print(str);

    display.display();
}
#endif